import Ticker from "react-ticker"
import { useEffect, useState } from "react"
import styles from "./styles/random-news.module.scss"

const randomNews = [
  "دراسة تثبت أنَّ القناعة لا كنز ولا خرا",
  "فتاة تعود إلى بيتها متأخرة أمام جميع الجيران لتفوتها فرصة الزواج من حمودة ابن أم حمودة",
  "بيل غيتس يتبرّع بأربع مليارات وستمائة مليون كفّارة عن خطيئة الانترنت إكسبلورر",
  "مطعم متحضر يُزيل الشطافة من حماماته",
  "مسؤول يُحال إلى التقاعد قبل وفاته لدخوله في حالة موت سريري",
  "موظّف حكوميّ يضطرّ للنوم باكراً كونه لم يحصل على قسطٍ كافٍ من النوم خلال الدوام",
  "“كان بإمكان مستخدمي فيسبوك حماية معلوماتهم الشخصية لو اقتدوا بأمير الأحزان”",
  "دليل الحدود: كيف تتصالح مع الدابّة في داخلك",
  "الحكومة تؤكّد أنها لا تقدم على أيٍّ من تخبطاتها وأخطائها إلا بعد دراستها بشكل دقيق",
  "أمٌ تُعدُّ أبناءها للديموقراطية بسؤالهم عمَّا يرغبون بتناوله قبل أن تطبخ الملوخية على أية حال",
  "الحكومة تطور مناخاً عاما يسمح لليأس بالتواجد مع الحياة، بل والازدهار أيضاً",
  "محلل سياسي مُتعمق يغفل عن قراءة خبر لانهماكه بتحليل ما بين السطور",
  "قصة نجاح: شاب يستخرج أول منديل في العلبة بحالة قابلة للاستخدام",
  "شاب يتعمّد إضاعة هويته الشخصية ليتمكن من إصدار هوية بصورة أقل إثارة للحرج",
  "رأس فتاة يقرر أن يحكها فور انتهائها من وضع طلاء الأظافر",
  "ولي عهد يطالب والده بترك شيء له ليسرقه في المستقبل",
  "أب يعالج ضعف الإضاءة في غرفة الجلوس بتركيب كشافات",
  "مطبّل للزعيم يرفض لعق حذائه حتى لا يوسِّخه بلعابه",
  "الفراغ في داخلك… ما هي الأطعمة الأنسب لملئه؟",
  "هل تعاني من مشاكل في التواصل مع الشريك؟ إليك ثلاث نصائح للتواصل مع غيره",
  "إطلاق منصة تواصل اجتماعي جديدة تلبي حاجة الناس للصياح",
  "مدير شركة يذهب لمكتبه بالليموزين بدل الهليكوبتر تعاطفاً مع موظفيه لدى تأخّر الرواتب",
  "موظف حكومي يطالب بتحديث الحواسيب في الدائرة، خصوصاً كرت الشاشة، أهم شيء كرت الشاشة",
  "طفل ظريف يرطب أذُنك بسِرّ",
  "إسرائيل تدرس الانضمام للتحالف الدولي لتتمكّن من التحليق فوق سوريا وقصفها بأريحية كباقي الدول",
  "قليلة ذوق لا تضحك على نكتة زميلها حول ضرورة بقائها في المطبخ",
  "ما هو عدد اللفات المسموح بها على البوفيه المفتوح قبل أن يعرف الناس حقيقتك، أنك خنزير؟",
  "ما المدة الزمنية المناسبة لتحفظ ماء وجهك وكرامتك حين ترضى لوحدك بعد الزعل؟",
  "أزمة المياه تنقذ شاباً كاد يغرق في شبر ماء",
  "إشكالية العدالة.. ما الجدوى من إلحاح الشعوب العربية على تحقيقها قبل الحياة الآخرة؟",
  "إنفلونسر يبثّ من الحمام ليرينا الطريقة المثلى لقضاء الحاجة",
  "بعوضة تباغت أذن شاب كاد يغط بالنوم قبل الفجر",
  "شاب يقود عكس السير لثقته بأن الجميع سيعرفون أنه بهيم ويفتحون له الطريق",
  "رجل ضعيف يعتذر",
  "تجمد وسقوط مؤخرة شاب مكث في الحمام أكثر من دقيقة",
]

function RandomNews() {
  const [move, setMove] = useState(true)
  const [isFontLoaded, setIsFontLoaded] = useState(false)

  useEffect(() => {
    document.fonts.ready.then(() => {
      setIsFontLoaded(true)
    })
  }, [])

  return (
    <div onDoubleClick={() => setMove(!move)} className={styles.container}>
      <h3>الشريط العشوائي</h3>
      {isFontLoaded && (
        <Ticker
          direction="toRight"
          speed={5}
          move={move}
          onMouseEnter={() => setMove(false)}
          onMouseLeave={() => setMove(true)}
        >
          {({ index }) => {
            if (index % 2 !== 0) {
              return (
                <div
                  style={{
                    fontSize: "30px",
                    lineHeight: 0.7,
                  }}
                >
                  ،
                </div>
              )
            }
            return (
              <div
                style={{
                  margin: "3px 10px 0",
                  color: "#777",
                  whiteSpace: "nowrap",
                }}
              >
                {randomNews[index % randomNews.length]}
              </div>
            )
          }}
        </Ticker>
      )}
    </div>
  )
}

export default RandomNews
